areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
/*LICENSE *****************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright (R) 2012 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/

// Device header file
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>

#include "p33SMPS_hspwm_c.h"


/*!p33MP_hspwm.c
 * ************************************************************************************************
 * Summary:
 * Driver file for the dsPIC33CxxxMPxxx-PWM SFRs
 *
 * Description:
 * The SMPS PWM module offers a large number of registers and configuration options. This additional
 * driver file contains initialization routines for all required settings.
 * ***********************************************************************************************/

/*!hspwm_power_enable
 * ************************************************************************************************
 * Summary:
 * Enables the bias power to the high resolution PWM module
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * PICmicro controllers offer so-called PERIPHERAL MODULE DISABLE (PMD) registers turning on/off
 * the bias power to on-chip peripheral blocks. This routine enables the bias power to the high-
 * resolution PWM module.
 * ***********************************************************************************************/
inline volatile uint16_t hspwm_power_enable(void) {
// enable power to peripheral
    _HSPWM_POWER_ENABLE;
    return(1 - _PWMMD);
}

/*!hspwm_power_disable
 * ************************************************************************************************
 * Summary:
 * Disables the bias power to the high resolution PWM module
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * PICmicro controllers offer so-called PERIPHERAL MODULE DISABLE (PMD) registers turning on/off
 * the bias power to on-chip peripheral blocks. This routine disables the bias power to the high-
 * resolution PWM module.
 * ***********************************************************************************************/
inline volatile uint16_t hspwm_power_disable(void) {
// disable power to peripheral
    _HSPWM_POWER_DISABLE;
    return(1 - _PWMMD);
}

/*!hspwm_init_independent_pwm
 * ************************************************************************************************
 * Summary:
 * Sets the basic configuration of a PWM generator 
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * This PWM channel configuration includes PWMxH/PWMxL outputs, selection of clock source and dividers,
 * dead times and events. Each channel configuration disables the channel by default. the PWM channel 
 * needs to be enabled by using the function call "hspwm_enable_pwm".
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_init_independent_pwm(
            uint16_t channel, 
            REGBLK_PCLK_CONFIG_t regPCLK, 
            REGBLK_PGxCH_CONFIG_t regPGxCON, 
            REGBLK_PGxEVT_CONFIG_t regPGxEVT,
            REGBLK_PGxIO_CONFIG_t regPGxIOCON, 
            REGBLK_PGxDEAD_TIME_t regPGxDT
    )
{
    
    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint32_t *regptr32;
    volatile uint16_t reg_offset;

    // write clock configuration
    regptr16 = (volatile uint16_t*) &PCLKCON;
    *regptr16 = (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK);

    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PCLKCON_VALID_DATA_READ_MASK) == (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK));
    
    // write PWM channel configuration
    reg_offset = (channel-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1CONL + reg_offset);
    *regptr32 = (regPGxCON.value & REG_PGxCON_VALID_DATA_WRITE_MASK);

    // write PWM channel event configuration
    reg_offset = (channel-1) * ((volatile uint16_t)&PG2EVTL - (volatile uint16_t)&PG1EVTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1EVTL + reg_offset);
    *regptr32 = (regPGxEVT.value & REG_PGxEVT_VALID_DATA_WRITE_MASK);

    // write IO configuration
    reg_offset = (channel-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    *regptr32 = (regPGxIOCON.value & REG_PGxIOCON_VALID_DATA_WRITE_MASK);

    // write dead time
    reg_offset = (channel-1) * ((volatile uint16_t)&PG2DTL - (volatile uint16_t)&PG1DTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1DTL + reg_offset);
    *regptr32 = (regPGxDT.value & REG_PGxDT_VALID_DATA_WRITE_MASK);
    
    return(fres);

